export const exampleBook = {
  imageUrl: 'https://ir.ozone.ru/s3/multimedia-1-i/8427096306.jpg',
  title: 'Хаски и его учитель белый кот',
  author: 'Жоубао Бучи Жоу',
  genreFirst: 'Сянься',
  genreSecond: 'Романтика',
  averageRating: 4.9,
  description:
    'Герой культового китайского романа неожиданно 68 получает возможность изменить свою историю. Тасянь-цзюнь, «Собачий император», это не просто прозвище, а символ разрушения, злоупотребления властью и одиночества. Он всю жизнь безжалостно сокрушал врагов и предавал друзей его имя пугало и живых, и мёртвых. Но даже монстр может устать. И когда герой добровольно уходит из жизни, ему выпадает второй шанс: он просыпается в прошлом. Когда-то Тасянь-цзюнь был чудовищем и тираном, а теперь он снова юноша, ученик духовной школы. И есть шанс всё исправить. Император Тасянь-цзюнь – Мо Жань оказывается среди людей, которых он однажды предал, в школе Сюаньцзю. Труднее всего для героя снова встретиться с Чу Ваньнином, строгим и бесчувственным наставником, чья сила духа и верность принципам становятся главной причиной непонимания и ненависти Мо Жаня к учителю. Но можно ли избежать судьбы, если прошлое уже живёт в тебе?',
};

export const exampleReviews = [
  {
    id: '1',
    userName: 'Ария Бочкина',
    dateText: '07.01.26',
    avatarSource: require('../assets/icons/profile-avatar.png'),
    title: 'Хаски и его учитель белый кот',
    author: 'Митбан',
    rating: 5,
    text: 'Моя самая любимая книга из всех существующих на планете!! Неожиданные сюжетные повороты, неоднозначные персонажи, постоянные эмоциональные качели, а главное - романтические линии',
    showEdit: false,
  },
  {
    id: '2',
    userName: 'Ария Бочкина',
    dateText: '07.01.26',
    avatarSource: require('../assets/icons/profile-avatar.png'),
    title: 'Хаски и его учитель белый кот',
    author: 'Митбан',
    rating: 4,
    text: 'Моя самая любимая книга из всех существующих на планете!! Неожиданные сюжетные повороты, неоднозначные',
    showEdit: true,
    onPressEdit: () => {},
  },
];

